<a href="https://colab.research.google.com/github/roxyrong/w266_project/blob/main/t5_finetune_text_to_sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%%capture
!pip install transformers
!pip install sentencepiece
!pip install accelerate -U

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
%cd /content/drive/MyDrive/Github/w266_project

import sys
project_path = '/content/drive/MyDrive/Github/w266_project'
sys.path.append(project_path)

/content/drive/MyDrive/Github/w266_project

In [ ]:
import os
import subprocess
import numpy as np
import pandas as pd
import nltk
import torch
from transformers import T5Tokenizer, T5ForConditionalGeneration
from transformers import Seq2SeqTrainingArguments, Seq2SeqTrainer

In [ ]:
# for evaluation
nltk.download('punkt')

[nltk_data] Downloading package punkt to /root/nltk_data...
[nltk_data]   Unzipping tokenizers/punkt.zip.

True

In [ ]:
from third_party.spider.process_sql import Schema, get_sql, get_schema

In [ ]:
# datasets
with open('spider/train_spider.json', 'r') as f:
    train_spider = pd.read_json(f)
with open('spider/train_others.json', 'r') as f:
    others_spider = pd.read_json(f)
with open('spider/dev.json', 'r') as f:
    dev_spider = pd.read_json(f)

In [ ]:
# load schema for all tables
with open('spider/tables.json', 'r') as f:
    schema_df = pd.read_json(f)

db_dir = f"spider/database"
schema_dict = {}
for idx, row in schema_df.iterrows():
    db = row['db_id']
    db_path = os.path.join(db_dir, db, db + ".sqlite")
    schema = str(get_schema(db_path))
    schema_dict[db] = schema

In [ ]:
# shuffle the dataset

train_spider = train_spider.iloc[np.random.permutation(train_spider.index)].reset_index(drop=True)
others_spider = train_spider.iloc[np.random.permutation(others_spider.index)].reset_index(drop=True)

# Model Architecture

In [ ]:
# construct prompt

prefix = 'translate English to SQL:'
train_spider['schema'] = train_spider['db_id'].map(schema_dict)
train_spider['prompt'] = prefix + train_spider['question'] + '\nDatabse schema is ' + train_spider['schema']
others_spider['schema'] = others_spider['db_id'].map(schema_dict)
others_spider['prompt'] = prefix + others_spider['question'] + '\nDatabse schema is ' + others_spider['schema']
dev_spider['schema'] = dev_spider['db_id'].map(schema_dict)
dev_spider['prompt'] = prefix + dev_spider['question'] + '\nDatabse schema is ' + dev_spider['schema']

In [ ]:
def preprocess_data(text_pair, tokenizer, max_length=128):
    orig_text, target_text = text_pair
    orig_encoded = tokenizer.batch_encode_plus(
        [orig_text],
        max_length=max_length,
        padding='max_length',
        truncation=True,
        return_attention_mask=True,
        return_tensors='pt'
    )

    orig_input_ids = orig_encoded['input_ids'][0]
    orig_attention_mask = orig_encoded['attention_mask'][0]

    target_encoded = tokenizer.batch_encode_plus(
        [target_text],
        max_length=max_length,
        padding='max_length',
        truncation=True,
        return_attention_mask=True,
        return_tensors='pt'
    )

    label_ids = target_encoded['input_ids'][0]

    return {'input_ids': orig_input_ids,
            'attention_mask': orig_attention_mask,
            'labels': label_ids}

In [ ]:
class TranslationDataIterator:

    def __init__(self,
                 df,
                 tokenizer,
                 max_load_at_once,
                 max_length=128,
                 shuffle=True):

        self.df = df
        self.tokenizer = tokenizer
        self.n_examples = len(df)
        self.max_load_at_once = max_load_at_once
        self.max_length = max_length
        self.shuffle = shuffle

        # Initialize row order, call on_epoch_end to shuffle row indices
        self.row_order = np.arange(1, self.n_examples+1)
        self.on_epoch_end()

        # Load first chunk of max_load_at_once examples
        self.df_curr_loaded = self._load_next_chunk(0)
        self.curr_idx_in_load = 0

    def _load_next_chunk(self, idx):
        load_start = idx
        load_end = idx + self.max_load_at_once

        # Indices to skip are the ones in the shuffled row_order before and
        # after the chunk we'll use for this chunk
        self.df_curr_loaded = self.df.iloc[load_start:load_end].sample(frac=1)

    def __len__(self):
        return self.n_examples

    def __getitem__(self, idx):
        if self.df_curr_loaded is None or self.curr_idx_in_load >= len(self.df_curr_loaded):
            self._load_next_chunk(idx)
            self.curr_idx_in_load = 0

        text_pair = self.df_curr_loaded[['prompt', 'query']].values.astype(str)[self.curr_idx_in_load]
        self.curr_idx_in_load += 1

        item_data = preprocess_data(
            text_pair,
            self.tokenizer,
            self.max_length
        )

        return item_data

    def __call__(self):
        for i in range(self.__len__()):
            yield self.__getitem__(i)

            if i == self.__len__()-1:
                self.on_epoch_end()

    def on_epoch_end(self):
        if self.shuffle:
            self.row_order = list(np.random.permutation(self.row_order))

# Model Training

In [ ]:
%%capture

tokenizer = T5Tokenizer.from_pretrained("t5-base")
model = T5ForConditionalGeneration.from_pretrained("t5-base")

In [ ]:
max_length = 512
max_load_at_once = 100

train_data_iterator = TranslationDataIterator(
    df=train_spider,
    tokenizer=tokenizer,
    max_load_at_once=max_load_at_once,
    max_length=max_length
)

valid_data_iterator = TranslationDataIterator(
    df=others_spider,
    tokenizer=tokenizer,
    max_load_at_once=max_load_at_once,
    max_length=max_length
)

In [ ]:
batch_size = 16

train_path = project_path + '/t5base-finetuned-spider'

args = Seq2SeqTrainingArguments(
    train_path,
    evaluation_strategy='epoch',
    per_device_train_batch_size=batch_size,
    per_device_eval_batch_size=batch_size,
    num_train_epochs=3,
)

In [ ]:
trainer = Seq2SeqTrainer(
    model,
    args,
    train_dataset=train_data_iterator,
    eval_dataset=valid_data_iterator
)

In [ ]:
# start from scratch
trainer.train()

# start from a checkpoint
# trainer.train(resume_from_checkpoint= model_path + '/checkpoint-1000')

TrainOutput(global_step=1314, training_loss=0.09416797498589781, metrics={'train_runtime': 1470.0904, 'train_samples_per_second': 14.285, 'train_steps_per_second': 0.894, 'total_flos': 1.280760235425792e+16, 'train_loss': 0.09416797498589781, 'epoch': 3.0})

In [ ]:
model_path = train_path + '/t5base-finetuned'
trainer.save_model(model_path)

# Evaluation

In [ ]:
finetune_model = T5ForConditionalGeneration.from_pretrained(model_path)

In [ ]:
# evaluate
max_length = 128

inputs = tokenizer.batch_encode_plus(
        list(dev_spider['prompt']),
        max_length=max_length,
        padding='max_length',
        truncation=True,
        return_attention_mask=True,
        return_tensors='pt'
    )

output_tokens = finetune_model.generate(
    input_ids=inputs["input_ids"],
    attention_mask=inputs["attention_mask"],
    max_length=128
)

outputs = [tokenizer.decode(i, skip_special_tokens=True) for i in output_tokens]

In [ ]:
with open('t5base-finetuned-spider/predicted_result.txt', 'a') as f:
    for idx, output in enumerate(outputs):
        db_id = dev_spider.iloc[idx]['db_id']
        f.write(output + '\t' + db_id + '\n')

In [ ]:
# evaluate results
eval_path = f"third_party/spider/evaluation.py"
gold = f"third_party/spider/evaluation_examples/gold_example.txt"
pred = f"t5base-finetuned-spider/predicted_result.txt"
db_dir = f"spider/database"
table = f"spider/tables.json"
etype = "all"

cmd_str = f"python3 \"{eval_path}\" --gold \"{gold}\" --pred \"{pred}\" --db \"{db_dir}\" --table \"{table}\" --etype {etype} "
result = subprocess.run(cmd_str, shell=True, capture_output=True, text=True)

In [50]:
import pprint
pprint.pprint(result.stdout)

('easy pred: SELECT sum(T1.song_name) FROM singer AS T1 JOIN singer AS T2 ON '
 'T1.singer_id = T2.singer_id GROUP BY T1.singer_id\n'
 'easy gold: SELECT count(*) FROM singer\n'
 '\n'
 'medium pred: SELECT name, country, age FROM singer ORDER BY age DESC LIMIT '
 '1\n'
 'medium gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC\n'
 '\n'
 'medium pred: SELECT avg(age), min(age), max(age) FROM singer GROUP BY age\n'
 'medium gold: SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE '
 "country  =  'France'\n"
 '\n'
 'eval_err_num:1\n'
 'medium pred: SELECT T1.name, T1.song_release_year FROM singer AS T1 JOIN '
 'song AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.song_name ORDER BY '
 'T1.song_release_year DESC LIMIT 1\n'
 'medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age '
 'LIMIT 1\n'
 '\n'
 'eval_err_num:2\n'
 'medium pred: SELECT T1.name, T1.song_release_year FROM singer AS T1 JOIN '
 'song AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.song_name ORDER BY '
 'T1.song_release_year DESC LIMIT 1\n'
 'medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age '
 'LIMIT 1\n'
 '\n'
 'medium pred: SELECT count(*) FROM singer WHERE country = "USA"\n'
 'medium gold: SELECT country ,  count(*) FROM singer GROUP BY country\n'
 '\n'
 'hard pred: SELECT name FROM singer WHERE age > (SELECT avg(age) FROM '
 'singer)\n'
 'hard gold: SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM '
 'singer)\n'
 '\n'
 'eval_err_num:3\n'
 'hard pred: SELECT T1.name FROM singer AS T1 JOIN singer AS T2 ON '
 'T1.singer_id = T2.singer_id WHERE T2.age > (SELECT avg(age) FROM '
 'singer_in_concert)\n'
 'hard gold: SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM '
 'singer)\n'
 '\n'
 'eval_err_num:4\n'
 'medium pred: SELECT T2.Location, T2.Name FROM stadium AS T1 JOIN stadium AS '
 'T2 ON T1.Stadium_ID = T2.Stadium_ID WHERE T2.Capacity  5000\n'
 'medium gold: SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN '
 '5000 AND 10000\n'
 '\n'
 'eval_err_num:5\n'
 'medium pred: SELECT T2.location, T2.name FROM station AS T1 JOIN stadium AS '
 'T2 ON T1.stadium_id = T2.stadium_id WHERE capacity  5000 INTERSECT SELECT '
 'T2.location, T2.name FROM station AS T3 JOIN stadium AS T4 ON T3.stadium_id '
 '= T4.stadium_id WHERE capacity  10000\n'
 'medium gold: SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN '
 '5000 AND 10000\n'
 '\n'
 'eval_err_num:6\n'
 'medium pred: SELECT T2.name, count(*) FROM stadium AS T1 JOIN concert AS T2 '
 'ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n'
 'medium gold: SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS '
 'T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id\n'
 '\n'
 'medium pred: SELECT count(*) FROM stadium GROUP BY stadium_id\n'
 'medium gold: SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS '
 'T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id\n'
 '\n'
 'eval_err_num:7\n'
 'extra pred: SELECT T2.name, T2.capacity FROM concert AS T1 JOIN stadium AS '
 'T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2014 ORDER BY T1.year '
 'DESC LIMIT 1\n'
 'extra gold: SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS '
 'T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY '
 'T2.stadium_id ORDER BY count(*) DESC LIMIT 1\n'
 '\n'
 'extra pred: SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS '
 'T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013\n'
 'extra gold: SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS '
 'T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY '
 'T2.stadium_id ORDER BY count(*) DESC LIMIT 1\n'
 '\n'
 'eval_err_num:8\n'
 'hard pred: SELECT T1.Year FROM concert AS T1 JOIN concert AS T2 ON '
 'T1.Singer_ID = T2.Singer_ID GROUP BY T1.Song_Name ORDER BY count(*) DESC '
 'LIMIT 1\n'
 'hard gold: SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC '
 'LIMIT 1\n'
 '\n'
 'eval_err_num:9\n'
 'hard pred: SELECT Country FROM singer WHERE Age > 40 AND Age  30\n'
 'hard gold: SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT '
 'country FROM singer WHERE age  <  30\n'
 '\n'
 'eval_err_num:10\n'
 'hard pred: SELECT name FROM stadium WHERE year = 2014\n'
 'hard gold: SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 '
 'JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  '
 '2014\n'
 '\n'
 'hard pred: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT '
 'stadium_id FROM concert)\n'
 'hard gold: SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 '
 'JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  '
 '2014\n'
 '\n'
 'eval_err_num:11\n'
 'medium pred: SELECT T2.name, T2.theme, count(*) FROM concert AS T1 JOIN '
 'singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY '
 'T1.concert_name\n'
 'medium gold: SELECT T2.concert_name ,  T2.theme ,  count(*) FROM '
 'singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  '
 'T2.concert_id GROUP BY T2.concert_id\n'
 '\n'
 'eval_err_num:12\n'
 'medium pred: SELECT T2.name, T2.theme, count(*) FROM concert AS T1 JOIN '
 'singer AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name\n'
 'medium gold: SELECT T2.concert_name ,  T2.theme ,  count(*) FROM '
 'singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  '
 'T2.concert_id GROUP BY T2.concert_id\n'
 '\n'
 'eval_err_num:13\n'
 'medium pred: SELECT T1.name, count(*) FROM singer AS T1 JOIN concert AS T2 '
 'ON T1.singer_id = T2.singer_id GROUP BY T1.singer_id\n'
 'medium gold: SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN '
 'singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id\n'
 '\n'
 'eval_err_num:14\n'
 'medium pred: SELECT T1.name, count(*) FROM singer AS T1 JOIN concert AS T2 '
 'ON T1.singer_id = T2.singer_id GROUP BY T1.singer_id\n'
 'medium gold: SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN '
 'singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id\n'
 '\n'
 'eval_err_num:15\n'
 'hard pred: SELECT name FROM singer WHERE year = 2014\n'
 'hard gold: SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON '
 'T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  '
 'T3.concert_id WHERE T3.year  =  2014\n'
 '\n'
 'eval_err_num:16\n'
 'hard pred: SELECT T1.name FROM singer AS T1 JOIN concert AS T2 ON '
 'T1.singer_id = T2.singer_id WHERE T2.year = 2014\n'
 'hard gold: SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON '
 'T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  '
 'T3.concert_id WHERE T3.year  =  2014\n'
 '\n'
 'eval_err_num:17\n'
 "medium pred: SELECT name, nation FROM singer WHERE song_name LIKE 'Hey'\n"
 'medium gold: SELECT name ,  country FROM singer WHERE song_name LIKE '
 "'%Hey%'\n"
 '\n'
 'eval_err_num:18\n'
 'medium pred: SELECT T1.name, T1.country FROM singer AS T1 JOIN singer AS T2 '
 "ON T1.singer_id = T2.singer_id WHERE T1.title LIKE 'Hey'\n"
 'medium gold: SELECT name ,  country FROM singer WHERE song_name LIKE '
 "'%Hey%'\n"
 '\n'
 'eval_err_num:19\n'
 'extra pred: SELECT T2.name, T2.location FROM concert AS T1 JOIN stadium AS '
 'T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year = 2014 INTERSECT SELECT '
 'T2.name, T2.location FROM concert AS T3 JOIN stadium AS T4 ON T3.stadium_id '
 '= T4.stadium_id WHERE T4.year = 2015 INTERSECT SELECT T3.name, T4.location '
 'JOIN stadium AS T4 ON T2.stadium_i\n'
 'extra gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS '
 'T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT '
 'SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON '
 'T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015\n'
 '\n'
 'eval_err_num:20\n'
 'extra pred: SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS '
 'T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year = 2014 INTERSECT SELECT '
 'T1.name, T2.location FROM stadium AS T3 JOIN concert AS T4 ON T3.stadium_id '
 '= T4.stadium_id WHERE T4.year = 2015\n'
 'extra gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS '
 'T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT '
 'SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON '
 'T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015\n'
 '\n'
 'hard pred: SELECT count(*) FROM stadium WHERE capacity = "highest"\n'
 'hard gold: SELECT count(*) FROM concert AS T1 JOIN stadium AS T2 ON '
 'T1.stadium_id  =  T2.stadium_id ORDER BY T2.Capacity DESC LIMIT 1\n'
 '\n'
 'eval_err_num:21\n'
 'hard pred: SELECT count(*) FROM concert WHERE stadium_id = "stadium_id" '
 'ORDER BY capacity DESC LIMIT 1\n'
 'hard gold: SELECT count(*) FROM concert AS T1 JOIN stadium AS T2 ON '
 'T1.stadium_id  =  T2.stadium_id ORDER BY T2.Capacity DESC LIMIT 1\n'
 '\n'
 'eval_err_num:22\n'
 'easy pred: SELECT count(*) FROM Has_pet WHERE weight > 10\n'
 'easy gold: SELECT count(*) FROM pets WHERE weight  >  10\n'
 '\n'
 'eval_err_num:23\n'
 'medium pred: SELECT weight FROM Has_pet GROUP BY weight ORDER BY age DESC '
 'LIMIT 1\n'
 'medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n'
 '\n'
 'eval_err_num:24\n'
 'medium pred: SELECT T2.weight FROM Has_pet AS T1 JOIN Has_pet AS T2 ON '
 'T1.petid = T2.petid WHERE T1.pet_age = "Junior"\n'
 'medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n'
 '\n'
 'medium pred: SELECT max(weight), max(weight), pettype FROM pets\n'
 'medium gold: SELECT max(weight) ,  petType FROM pets GROUP BY petType\n'
 '\n'
 'eval_err_num:25\n'
 'medium pred: SELECT max(weight), pettype FROM Has_pet GROUP BY pettype\n'
 'medium gold: SELECT max(weight) ,  petType FROM pets GROUP BY petType\n'
 '\n'
 'eval_err_num:26\n'
 'medium pred: SELECT count(*) FROM Has_pet WHERE age > 20\n'
 'medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON '
 'T1.stuid  =  T2.stuid WHERE T1.age  >  20\n'
 '\n'
 'eval_err_num:27\n'
 'medium pred: SELECT count(*) FROM Has_pet WHERE age > 20\n'
 'medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON '
 'T1.stuid  =  T2.stuid WHERE T1.age  >  20\n'
 '\n'
 "hard pred: SELECT count(*) FROM Has_pet WHERE StuID = 'F'\n"
 'hard gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON '
 'T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  '
 "=  'F' AND T3.pettype  =  'dog'\n"
 '\n'
 "hard pred: SELECT count(*) FROM Has_pet WHERE StuID = 'F'\n"
 'hard gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON '
 'T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  '
 "=  'F' AND T3.pettype  =  'dog'\n"
 '\n'
 'eval_err_num:28\n'
 'easy pred: SELECT count(DISTINCT pettype) FROM Has_pet\n'
 'easy gold: SELECT count(DISTINCT pettype) FROM pets\n'
 '\n'
 "extra pred: SELECT fname FROM student WHERE StuID = 'Cat' OR StuID = 'Dog'\n"
 'extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 '
 'ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE '
 "T3.pettype  =  'cat' OR T3.pettype  =  'dog'\n"
 '\n'
 'eval_err_num:29\n'
 "extra pred: SELECT fname FROM Has_pet WHERE StuID = 'Cat' OR StuID = 'Dog'\n"
 'extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 '
 'ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE '
 "T3.pettype  =  'cat' OR T3.pettype  =  'dog'\n"
 '\n'
 'eval_err_num:30\n'
 "extra pred: SELECT fname FROM student WHERE sex = 'cat' INTERSECT SELECT "
 "fname FROM has_pet WHERE sex = 'dog'\n"
 'extra gold: SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON '
 'T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE '
 "T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN "
 'has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  '
 "T2.petid WHERE T3.pettype  =  'dog'\n"
 '\n'
 'eval_err_num:31\n'
 "extra pred: SELECT fname FROM Has_pet WHERE sex = 'Kat' INTERSECT SELECT "
 "fname FROM Has_pet WHERE sex = 'Chinese'\n"
 'extra gold: SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON '
 'T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE '
 "T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN "
 'has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  '
 "T2.petid WHERE T3.pettype  =  'dog'\n"
 '\n'
 'eval_err_num:32\n'
 'extra pred: SELECT Major, Age FROM student WHERE has_pet NOT IN (SELECT '
 'StuID FROM Has_pet)\n'
 'extra gold: SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT '
 'T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN '
 "pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')\n"
 '\n'
 'eval_err_num:33\n'
 'extra pred: SELECT Major FROM student WHERE has_pet NOT IN (SELECT StuID '
 "FROM Has_pet WHERE has_pet = 'Cat')\n"
 'extra gold: SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT '
 'T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN '
 "pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')\n"
 '\n'
 'hard pred: SELECT StuID FROM Has_pet WHERE StuID NOT IN (SELECT StuID FROM '
 'Has_pet)\n'
 'hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS '
 'T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  '
 "=  T2.petid WHERE T3.pettype  =  'cat'\n"
 '\n'
 'eval_err_num:34\n'
 'hard pred: SELECT StuID FROM Has_pet WHERE StuID NOT IN (SELECT StuID FROM '
 'Has_pet WHERE StuID NOT IN (SELECT StuID FROM Has_pet)\n'
 'hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS '
 'T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  '
 "=  T2.petid WHERE T3.pettype  =  'cat'\n"
 '\n'
 'extra pred: SELECT fname, age FROM student WHERE StuID NOT IN (SELECT StuID '
 'FROM Has_pet)\n'
 'extra gold: SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 '
 'ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE '
 "T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 "
 'JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  '
 "T2.petid WHERE T3.pettype  =  'cat')\n"
 '\n'
 'eval_err_num:35\n'
 'extra pred: SELECT fname FROM student WHERE StuID NOT IN (SELECT StuID FROM '
 'Has_pet WHERE StuID NOT IN (SELECT StuID FROM Has_pet WHERE StuID NOT IN)\n'
 'extra gold: SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 '
 'ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE '
 "T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 "
 'JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  '
 "T2.petid WHERE T3.pettype  =  'cat')\n"
 '\n'
 'eval_err_num:36\n'
 'medium pred: SELECT T1.pettype, T1.pet_weight FROM Has_pet AS T1 JOIN '
 'Has_pet AS T2 ON T1.petid = T2.petid GROUP BY T1.petid ORDER BY count(*) '
 'DESC LIMIT 1\n'
 'medium gold: SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1\n'
 '\n'
 'eval_err_num:37\n'
 'medium pred: SELECT TYPE, T1.weight FROM Has_pet AS T1 JOIN Has_pet AS T2 ON '
 'T1.petid = T2.petid GROUP BY T1.petid ORDER BY T1.pet_age DESC LIMIT 1\n'
 'medium gold: SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1\n'
 '\n'
 'medium pred: SELECT t1.petid, t1.weight FROM pets AS t1 JOIN has_pet AS t2 '
 'ON t1.petid = t2.petid WHERE t1.pet_age > 1\n'
 'medium gold: SELECT petid ,  weight FROM pets WHERE pet_age  >  1\n'
 '\n'
 'eval_err_num:38\n'
 'medium pred: SELECT T1.petid, T1.weight FROM Has_pet AS T1 JOIN Has_pet AS '
 'T2 ON T1.petid = T2.petid WHERE T1.pet_age > 1\n'
 'medium gold: SELECT petid ,  weight FROM pets WHERE pet_age  >  1\n'
 '\n'
 'eval_err_num:39\n'
 'medium pred: SELECT avg(age), max(age) FROM Has_pet GROUP BY pettype\n'
 'medium gold: SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP '
 'BY pettype\n'
 '\n'
 'medium pred: SELECT avg(pet_age), max(pet_age) FROM pets\n'
 'medium gold: SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP '
 'BY pettype\n'
 '\n'
 'medium pred: SELECT avg(weight) FROM pets GROUP BY pettype\n'
 'medium gold: SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype\n'
 '\n'
 'eval_err_num:40\n'
 'medium pred: SELECT avg(weight), pettype FROM Has_pet\n'
 'medium gold: SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype\n'
 '\n'
 'eval_err_num:41\n'
 "medium pred: SELECT fname, age FROM student WHERE has_pet = 'pet'\n"
 'medium gold: SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN '
 'has_pet AS T2 ON T1.stuid  =  T2.stuid\n'
 '\n'
 'eval_err_num:42\n'
 'medium pred: SELECT DISTINCT T1.Fname, T1.Age FROM Has_pet AS T1 JOIN '
 "Student AS T2 ON T1.StuID = T2.StuID WHERE T2.PetType = 'pet'\n"
 'medium gold: SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN '
 'has_pet AS T2 ON T1.stuid  =  T2.stuid\n'
 '\n'
 'eval_err_num:43\n'
 'medium pred: SELECT t1.petid FROM Has_pet AS t1 JOIN Student AS t2 ON '
 "t1.petid = t2.petid WHERE t1.lname = 'Smith'\n"
 'medium gold: SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON '
 "T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'\n"
 '\n'
 'eval_err_num:44\n'
 'medium pred: SELECT T1.petid FROM Has_pet AS T1 JOIN Student AS T2 ON '
 "T1.petid = T2.petid WHERE T1.lname = 'Smith'\n"
 'medium gold: SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON '
 "T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'\n"
 '\n'
 'eval_err_num:45\n'
 "medium pred: SELECT count(*) FROM Has_pet WHERE UID = 'StuID'\n"
 'medium gold: SELECT count(*) ,  T1.stuid FROM student AS T1 JOIN has_pet AS '
 'T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid\n'
 '\n'
 "medium pred: SELECT count(*) FROM Has_pet WHERE StuID = 'petid'\n"
 'medium gold: SELECT count(*) ,  T1.stuid FROM student AS T1 JOIN has_pet AS '
 'T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid\n'
 '\n'
 'eval_err_num:46\n'
 'medium pred: SELECT fname, gender FROM student WHERE age > 1\n'
 'medium gold: SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 '
 'ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1\n'
 '\n'
 'eval_err_num:47\n'
 'medium pred: SELECT T1.fname, T1.sex FROM Has_pet AS T1 JOIN Student AS T2 '
 'ON T1.stuid = T2.stuid WHERE T1.pet_age > 1\n'
 'medium gold: SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 '
 'ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1\n'
 '\n'
 'hard pred: SELECT lname FROM student WHERE age = 3\n'
 'hard gold: SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON '
 'T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE '
 "T3.pet_age  =  3 AND T3.pettype  =  'cat'\n"
 '\n'
 'hard pred: SELECT lname FROM student WHERE age > 3\n'
 'hard gold: SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON '
 'T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE '
 "T3.pet_age  =  3 AND T3.pettype  =  'cat'\n"
 '\n'
 'eval_err_num:48\n'
 'extra pred: SELECT avg(age) FROM Has_pet WHERE StuID NOT IN (SELECT StuID '
 'FROM Has_pet)\n'
 'extra gold: SELECT avg(age) FROM student WHERE stuid NOT IN (SELECT T1.stuid '
 'FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid)\n'
 '\n'
 'eval_err_num:49\n'
 'extra pred: SELECT avg(age) FROM Has_pet WHERE StuID NOT IN (SELECT StuID '
 'FROM Has_pet)\n'
 'extra gold: SELECT avg(age) FROM student WHERE stuid NOT IN (SELECT T1.stuid '
 'FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid)\n'
 '\n'
 'eval_err_num:50\n'
 'medium pred: SELECT continent id, continentname, count(*) FROM continents '
 'GROUP BY continent\n'
 'medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS '
 'T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;\n'
 '\n'
 'eval_err_num:51\n'